Repository: AndWac/pkg5
Catalog: src/po/*.po
Languages: ar

source: BE name is invalid
ar: BE خطأ بالإسم

source: Ensuring %s is up to date...
ar: التحقق من %s محدث

source: Accessing this restricted repository failed. You either need to register to access this repository, the certificate expired, or you need to accept the repository certificate.
ar: الفشل بالدخول الى المستودع المقيد . يجب عليك أن تسجل من أجل الدخول الى المستودع إنتهت صلاحية الشهادة , أو أنت تحتاج لأن توافق على شهادة المستودع .

source: Please check the network connection. Is the repository accessible?
ar: الرجاء التحقق من إتصال الشبكة . إذا كان المستودع قابل للدخول عليه

source: Please check the network connection. Is the repository accessible? %s
ar: الرجاء التحقق من إتصال الشبكة . إذا كان المستودع قابل للدخول عليه %s

source: pkg(5) appears to be out of date and should be updated before running Update All. Please update SUNWipkg package
ar: pkg(5) يظهر على انه خارج التحديث ويجب تحديث قبل تشغيل الترقية الكلية الرجاء تحديث SUNWipkg حزمة

source: Cannot remove: %s Due to the following packages that depend on it:
ar: لايمكن إزالة : %s بسبب أن الحزم التالية لها تبعية على :

source: Failure of consistent use of pfexec or gksu when running %s is often a source of this problem.
ar: فشل التناغم إستعمل أمر pfexec or gksu عند التشغيل %s غالبا تكون مصدر المشكلة

source: To rebuild index, please use the terminal command:
ar: لإعادة بناء الفهرس , الرجاء إستعمل terminal command:

source: There was an error during installation. The search index is corrupted. You might want try to fix this problem by running command: pfexec pkg rebuild-index
ar: حدث خطأ أثناء التنصيب , البحث الفهرس قد دمر , يجب عليك أو تحاول حل المشكلة , بواسطة تشغيل الأمر : pfexec pkg rebuild-index

source: This is an Live Image. The install operation can't be performed.
ar: هذه صورة مباشرة .عملية التنصيب لايمكن أو تنفذ

source: There was an error during installation. The Plan of the operation is missing and the operation can't be finished. You might want try to fix this problem by restarting %s
ar: حدث خطأ أثناء التنصيب الخطة للعملية أنها فشلت والعملية لا يمكن إنهاؤها . يجب عليك محاولة حل المشكلة بعملية إعادة التشغيل %s

source: There was an error during installation. The State of the image is incorrect and the operation can't be finished. You might want try to fix this problem by restarting %s
ar: حدث خطأ أثناء التنصيب حالة الصورة يكون فيها خطأ والعملية لايمكن إنهاؤها . يجب عليك| كل المشكلة بعملية إعادة التشعيل %s

source: Specifying BE Name not supported.
ar: تعيين BE الإسم غير مدعوم

source: Invalid BE Name: %s.
ar: خطأ بإسم BE : %s

source: Updating %s
ar: ترقية %s

source: Executing...
ar: تنفيذ ....

source: Gathering packages information, please wait...
ar: تجميع معلومات الحزم , الرجاء الإنتظار ....

source: All packages already installed.
ar: كل الحزم منصبة مسبقا

source: Selected package(s) cannot be updated on their own. Click Update All to update all packages.
ar: إختيار الحزم (5)لايمكن تحديثها حيث هي إضغط على ترقية الكل لترقية كل الحزم

source: No futher information available
ar: لا يوجد معلومات إضافية متوفرة

source: Error:
ar: خطأ:

source: - Failed </b>
ar: - فشل </b>

source: An unknown error occured in the %s stage. Please let the developers know about this problem by filing a bug together with exception value at:
ar: حدث خطأ غير متوقع ضمن %sالمرحلة الرجاء إعلام المطورون حول هذه المشكلة بفلترة المشاكل بإستثناء القيم على :

source: Exception value:
ar: إستثناء القيم:

source: Exception traceback:
ar: إستثناءtraceback:

source: Downloaded %(current)s of %(total)s
ar: تحميل %(current)s of %(total)s

source: Catalog refresh failed during install.
ar: فشل تحديث الكاتالوج أثناء التنصيب

source: Catalog refresh failed during Update All.
ar: فشل تحديث الكاتالوج أثناء ترقية الكل

source: Installation completed successfully.
ar: نجاح عملية التنصيب

source: Packages removed successfully.
ar: نجاح إزالة الحزم

source: Packages updated successfully.
ar: نجاح ترقية الحزم

source: Not Enough Disk Space
ar: لاتوجد مساحة كافية على القرص

source: Packages To Be Updated:
ar: الحزم للترقية :

source: Packages To Be Installed:
ar: الحزم للتنصيب :

source: Packages To Be Removed:
ar: الحزم للإزالة :

source: Package %d of %d: %s
ar: الحزمة %d of %d: %s

source: Evaluating: %s
ar: تقييم : %s

source: GUI will not respond to any event! %s. Check repository.py signals
ar: GUI لن ترد على أي حال ! %s .تحقق إشارة repository.py

source: Add New Repository
ar: أضافة مستودع جديد

source: <b>New Repository</b>
ar: <b>مستودع جديدy</b>

source: Repository Name
ar: إسم المستودع

source: Preferred
ar: المفضل

source: Enabled
ar: تفعيل

source: Failed to disable %s.
ar: فشل بإلغاء التفعيل %s

source: Failed to enable %s.
ar: فشل بالتفعيل %s

source: Failed to disable %s.
ar: فشل بإلغاء التفعيل %s

source: Failed to enable %s.
ar: فشل بالتفعيل %s

source: Please check your permissions.
ar: الرجاء إفحص صلاحياتك

source: Please check the network connection or URL. Is the repository accessible?
ar: الرجاء التحقق من إتصال الشبكة أو العنوان (URL) إذا المستودع قابل للدخول عليه

source: Unexpected error.
ar: خطأ غير متوقع

source: Couldn't change the preferred publisher. Please check your permissions.
ar: لا يمكن تغير الناشر المفضل الرجاء التحقق من صلاحياتك

source: Name contains invalid characters
ar: الإسم يحوي أحرف خاطئة

source: Name already in use
ar: الإسم مستعمل من قبل

source: URL is not valid
ar: URL العنوان غير صحيح

source: Unable to navigate to: %s
ar: لايمكن الوصول الى : %s

source: Registration
ar: التسجيل

source: Adding New Repository
ar: إضافة مستودع جديد

source: Adding: %s (%s)...
ar: إضافة : %s (%s)....

source: Failed to add repository: %s
ar: الفشل بإضافة مستودع جديد : %s

source: Failed to add %s.
ar: الفشل بالإضافة %s.

source: Failed to add %s.
ar: الفشل بالإضافة %s.

source: Failed to delete %s.
ar: الفشل بالحذف %s.

source: Specify SSL Key File
ar: تعين ملف SSL key

source: Specify SSL Certificate File
ar: تعين ملف شهادة SSL

source: Repository error
ar: خطأ بالمستودع

source: unknown action type '%(type)s' in package '%(fmri)s' in action '%(action)s'
ar: نوع الخطأ غير معروف '%(type)s'بالحزمة '%(fmri)s' بالتنفيذ '%(action)s'

source: unknown action type '%(type)s' in action '%(action)s'
ar: نوع الخطأ غير معروف '%(type)s' بالتنفيذ '%(action)s'

source: Malformed action in package '%(fmri)s' at position: %(pos)d: %(action)s %(marker)s
ar: تشوه التنفيذ ضمن الحزمة: '%(fmri)s' ضمن القسم: %(pos)d: %(action)s %(marker)s

source: Malformed action at position: %(pos)d: %(action)s %(marker)s
ar: تشوه التنفيذ ضمن القسم: %(pos)d: %(action)s %(marker)s

source: invalid action in package %(fmri)s: %(action)s: %(error)s
ar: خطأ بالتنفيذ ضمن الحزمة %(fmri)s: %(action)s: %(error)s

source: invalid action, '%(action)s': %(error)s
ar: خطأ بالتنفيذ '%(action)s': %(error)s

source: required attribute '%s' was not provided.
ar: مطلوب خاصية '%s' غير مسموح بها

source: required attribute, '%s', was not provided.
ar: مطلوب خاصية '%s' غير مسموح بها

source: Could not operate on %s because of insufficient permissions. Please try the command again using pfexec or otherwise increase your privileges.
ar: لايمكن تنفيذ على %s لأنه لايوجد صلاحيات كافية , الرجاء جرب الأمر مرة أخرى بإستعمال pfexec او حاول الحصول على صلاحيات

source: Could not complete the operation because of insufficient permissions. Please try the command again using pfexec or otherwise increase your privileges.
ar: لايمكن إكمال العملية لأنه لايوجد صلاحيات كافية الرجاء جرب الأمر مرة أخرى بإستعمال pfexec او حاول الحصول على صلاحيات

source: Could not operate on %s because the file is in use. Please stop using the file and try the operation again.
ar: لايمكن تنفيذ على %s لانه الملف مستعمل . الرجاء الوقوف عن إستعمال الملف ثم حاول مرة أخرى لتنفيذ العملية

source: '%s' supports the following architectures: %s
ar: '%s' تدعم البنية التالية : %s

source: Image architecture is defined as: %s
ar: صورة البنية تعين : %s

source: No matching package could be found for the following FMRIs in any of the catalogs for the current publishers:
ar: لايستطيع إيجاد الحزم المتوافقة مع FMRI ضمن أني كاتالوج ضمن الناشر الحالي :

source: The specified file is in an unrecognized format or does not contain valid publisher information: %s
ar: الملف المعين غير معرف أو لا يحوي معلومات صحيحة عن الناشر : %s

source: The specified file is in an unrecognized format or does not contain valid publisher information.
ar: الملف المعين غير معرف أو لا يحوي معلومات صحيحة عن الناشر :

source: Unsupported pkg(5) publisher information data format.
ar: لا يدعم أمر pkg(5) نوع معلومات الناشر

source: Error encountered while retrieving data from '%s': %s
ar: خطأ يحدث عند محاولة الحصول على البيانات من '%s': %s

source: Error encountered while retrieving data from: %s
ar: خطأ يحدث عند محاولة الحصول على البيانات من : %s

source: '%s' is not a valid location.
ar: '%s' مسار غير صحيح

source: '%s' is not a valid boot envirnment name.
ar: '%s' إسم غير صحيح لبيئة الإقلاع

source: Boot environment naming during package install is not supported on this version of OpenSolaris. Please image-update without the --be-name option.
ar: تسمية بيئة الإقلاع خلال عملية التنصيب غير مدعومة على هذه الإصدار من OpenSolaris. الرجاء image-update بدون --be-name خيار

source: Unable to clone the current boot environment.
ar: لا يمكن إستنساخ نسخة من بيئة الإقلاع الحالية

source: A problem occurred while attempting to rename the boot environment currently named %(orig)s to %(dest)s.
ar: مشكلة حدثت بمحاولة إعادة تغير إسم بيئة الإقلاع الإسم الحالي %(orig)s الى %(dest)s.

source: Unable to mount %(name)s at %(mt)s
ar: لاأستطيع التحميل %(name)s at %(mt)s

source: Naming a boot environment when operating on a non-live image is not allowed.
ar: تسمية بيئة الإقلاع عندما الإقلاع لايكون من ضمن الصورة لايسمح به

source: Info does not recognize the following options:
ar: المعلومات لا تعرف الخيارات التالية :

source: Some servers failed to respond appropriately:
ar: فشل بعض الخوادم بالحصول على النتيجة الملائمة :

source: %s appears not to be a valid package depot.
ar: %s تظهر أنه يوجد خطأ بمستودع الحزم

source: Search capabilities and performance are degraded. To improve, run 'pkg rebuild-index'.
ar: البحث عن القدرات والأداء المبتذلة للتنفيذ , p'kg rebuild-index'

source: '%s' is not a valid publisher name.
ar: '%s' إسم غير صحيح للناشر

source: '%(value)s' is not a valid value for repository attribute '%(attribute)s'.
ar: '%(value)s' قيمة غير صحيحة لسمات المستودعات '%(attribute)s'.

source: '%s' is not a valid repository collection type.
ar: '%s' نوع غير صحيح لمجموعة المستودعات

source: '%s' is not a valid URI.
ar: '%s' عنوان غير صحيح URL

source: '%s' is not a valid URI priority; integer value expected.
ar: '%s' خطأ بأولوية عنوان URL : قيمة غير متوقعة

source: '%s' is not a valid repository URI sort policy.
ar: '%s' خطأ بتصنيف سياسة عنوان المستودع

source: Publisher '%s' is disabled and cannot be used for packaging operations.
ar: الناشر '%s' غير فعال ولا يمكن إستعماله لعميلة الحزم

source: A publisher with the same name or alias as '%s' already exists.
ar: الناشر بنفس الإسم أو إسم الشهرة '%s' بالأساس موجود

source: A repository with the same name or origin URIs already exists for publisher '%s'.
ar: المستودع بنفس الإسم او العنوان الأصلي URL موجود مسبقا للناشر '%s'

source: Mirror '%s' already exists for the specified repository.
ar: Mirror '%s' موجود مسبقا للمستودع المعين

source: Origin '%s' already exists for the specified repository.
ar: الأصل '%s' موجود مسبقا للمستودع المعين

source: The preferred publisher cannot be removed.
ar: الناشر المفضل لايمكن إزالته

source: Cannot remove the selected repository for a publisher.
ar: لايمكن إزالة المستودع المعلم كناشر

source: Unknown legal URI '%s'.
ar: عنوان URL شرعي غير معروف '%s'

source: Unknown publisher '%s'.
ar: ناشر غير معروف '%s'

source: Unknown related URI '%s'.
ar: عنوان URL له صلة غير معروف '%s'

source: Unknown repository '%s'.
ar: مستودع غير معروف '%s'

source: Unknown repository mirror '%s'.
ar: mirror مستودع غير معروف '%s'

source: Unknown repository origin '%s'
ar: اصل المستودع غير معروف '%s'

source: The URI '%(uri)s' contains an unsupported scheme '%(scheme)s'.
ar: العنوان URL '%(uri)s' يحوي مخطط غير مدعوم '%(scheme)s'.

source: The specified URI contains an unsupported scheme.
ar: العنوان URL المعين يحوي مخطط غير مدعوم

source: '%(attr)s' is not supported for '%(scheme)s'.
ar: '%(attr)s' غير مدعوم '%(scheme)s'.

source: Certificate '%(cert)s' for publisher '%(pub)s' needed to access '%(uri)s', has expired. Please install a valid certificate.
ar: الشهادة '%(cert)s' للناشر '%(pub)s' '%(uri)s', يطلب الدخول إنتهت صلاحية . الرجاء الشهادة

source: Certificate '%(cert)s' for publisher '%(pub)s', has expired. Please install a valid certificate.
ar: الشهادة '%(cert)s' للناشر '%(pub)s', إنتهت الصلاحية الرجاء تنصيب شهادة صحيحة

source: Certificate '%(cert)s', needed to access '%(uri)s', has expired. Please install a valid certificate.
ar: الشهادة '%(cert)s',مطلوب للدخول '%(uri)s', إنتهت الصلاحية الرجاء تنصيب شهادة صحيحة

source: Certificate '%s' has expired. Please install a valid certificate.
ar: الشهادة '%s' إنتهت الصلاحية الرجاء تنصيب شهادة صحيحة

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', will expire in '%(days)s' days.
ar: الشهادة '%(cert)s' للناشر '%(pub)s', مطلوب الدخول '%(uri)s', ستنتهي الصلاحية في '%(days)s' يوم

source: Certificate '%(cert)s' for publisher '%(pub)s' will expire in '%(days)s' days.
ar: الشهادة '%(cert)s' للناشر '%(pub)s' سينتهي في '%(days)s' يوم

source: Certificate '%(cert)s', needed to access '%(uri)s', will expire in '%(days)s' days.
ar: الشهادة '%(cert)s', يحتاج الدخول '%(uri)s',سينتهي في '%(days)s' ايام

source: Certificate '%(cert)s' will expire in '%(days)s' days.
ar: الشهادة '%(cert)s' ستنتهي '%(days)s' أيام

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', is invalid.
ar: شهادة '%(cert)s' للناشر '%(pub)s', يحتاج الدخول '%(uri)s', غير صحيح.

source: Certificate '%(cert)s' for publisher '%(pub)s' is invalid.
ar: الشهادة '%(cert)s' للناشر '%(pub)s' غير صحيح

source: Certificate '%(cert)s' needed to access '%(uri)s' is invalid.
ar: الشهادة '%(cert)s' يحتاج للدخول '%(uri)s' غير صحيح

source: Invalid certificate '%s'.
ar: خطأ بالشهادة '%s'

source: Unable to locate certificate '%(cert)s' for publisher '%(pub)s' needed to access '%(uri)s'.
ar: لايمكن معرفة مكان الشهادة '%(cert)s' للناشر '%(pub)s' تحتاج للدخول '%(uri)s'.

source: Unable to locate certificate '%(cert)s' for publisher '%(pub)s'.
ar: لايمكن معرفة مكان الشهادة '%(cert)s'للناشر '%(pub)s'.

source: Unable to locate certificate '%(cert)s' needed to access '%(uri)s'.
ar: لايمكن معرفة مكان الشهادة '%(cert)s'للناشر '%(uri)s'.

source: Unable to locate certificate '%s'.
ar: لايمكن معرفة مكان الشهادة '%s'

source: Certificate '%(cert)s' for publisher '%(pub)s', needed to access '%(uri)s', has a future effective date.
ar: الشهادة '%(cert)s' للناشر '%(pub)s', يحتاج الدخول '%(uri)s', تاريخ تأثير الخيارات .

source: Certificate '%(cert)s' for publisher '%(pub)s' has a future effective date.
ar: الشهادة '%(cert)s' للناشر '%(pub)s' تاريخ تأثير الخيارات.

source: Certificate '%(cert)s' needed to access '%(uri)s' has a future effective date.
ar: الشهادة '%(cert)s' للناشر '%(uri)s' تاريخ تأثير الخيارات.

source: Certificate '%s' has a future effective date.
ar: الشهادة '%s' تاريخ تأثير الخيارات

source: Gave a bad response:%s
ar: إستلام رد خاطئ :%s

source: pkg: unable to create an auto snapshot. pkg recovery is disabled.
ar: pkg : لايمكن إنشاء snapshot بشكل أتوماتيكي

source: pkg: A system error %s was caught executing %s
ar: pkg : خطأ نظام %s تم الحصول على المفذ %s

source: pkg: '%s' failed. with a return code of %d.
ar: pkg: '%s' failed. بأعادة الكود %d.

source: pkg: unable to activate %s
ar: pkg : لايمكن التفعيل %s

source: pkg: unable to unmount %s
ar: pkg : لايمكن العدم التحميل : %s

source: A clone of %s exists and has been updated and activated. On the next boot the Boot Environment %s will be mounted on '/'. Reboot when ready to switch to this updated BE.
ar: إستنساخ نسخة من %s من النسخة الموجودة قد تم التحديث وتفعل على الإقلاع التالي بيئة الإقلاع %s سوف تحمل إعادة التشغيل سيكون جاهز للتبديل مع الترقية BE.

source: %s has been updated successfully
ar: %s تمت عملية الترقية بنجاح

source: The running system has not been modified. Modifications were only made to a clone of the running system. This clone is mounted at %s should you wish to inspect it.
ar: تشغيل النظام المعين. والتعديلات التي سوف تنسخ حالة النظام المشغل .هذه النسخةتحمل %s يجب أن تكون تفحص

source: pkg: unable to rollback BE %s and restore image
ar: pkg : لايمكن إعادة BE %s وإستعادة صورة النظام

source: %s failed to be updated. No changes have been made to %s.
ar: %s الفشل بالترقية . لم تطرأ أية تغييرات على %s.

source: pkg: unable to destroy snapshot %s
ar: pkg : لايستطيع تدمير snapshot %s

source: pkg: unable to create BE %s
ar: pkg : لايستطيع إنشاء BE %s

source: pkg: unable to mount BE %s on %s
ar: pkg : لا يستطيع تحميل BE %s على %s

source: The Boot Environment %s failed to be updated. A snapshot was taken before the failed attempt and is mounted here %s. Use 'beadm unmount %s' and then 'beadm activate %s' if you wish to boot to this BE.
ar: فشل بيئة %sالإقلاع بالترقية . A snapshot تؤخد قبل فشل محاولة وتحمل %sإستعمل beadm unmount %s ثم beadm activate %s إذا أردت الإقلاع على هذه BE

source: The Boot Environment %s failed to be updated. A snapshot was taken before the failed attempt and has been restored so no changes have been made to %s.
ar: فشل بيئة %sالإقلاع بالترقية . A snapshot توخذ قبل فشل محاولة وتعادتحميلها لذى لايوجد أي تغيرات قد حدثت : %s

source: This server is not a valid package depot.
ar: هذا المخدم مستودع غير صحيح للحزم

source: Before evaluation:
ar: قبل التقييم :

source: After evaluation:
ar: بعد التقييم :

source: SUNWipkg update check failed.
ar: SUNWipkg فشل بالتحقق من الترقية

source: Checking SUNWipkg and SUNWipkg-gui versions Please wait ...
ar: البحث SUNWipkg and SUNWipkg-gui الرجاء الإنتظار ....

source: GUI will not respond to any event! %s.Check declare_signals()
ar: GUI لا تستجيب لأي حدث ! %s تحقق من declare_signals()

source: All Repositories Search Results
ar: نتائج بحث كل المستودعات

source: All
ar: الكل

source: Loading...
ar: تحميل ....

source: Stopped
ar: توقف

source: Done
ar: تم

source: No URI specified
ar: لايوجد عنوان معرف (URL)

source: Empty Action not supported
ar: فارغة لاتؤيد العمل

source: Action not supported: %s
ar: لاتؤيد العمل : %s

source: Name
ar: الإسم

source: Status
ar: الحالة

source: Repository
ar: المستودع

source: Description
ar: التفاصيل

source: Updates Available
ar: الترقية متوفرة

source: Not Installed
ar: ليست منصبة

source: All Categories
ar: كل الفئات

source: Meta Packages
ar: meta الحزم

source: Applications
ar: التطبيقات

source: Desktop (GNOME)
ar: سطح المكتب (GNOME)

source: Development
ar: تطوير

source: Distributions
ar: تفاصيل

source: Drivers
ar: تعريفات

source: Web Services
ar: خدمة الويب

source: All Packages
ar: كل الحزم

source: Installed Packages
ar: الحزم المنصبة

source: Non-installed Packages
ar: حزم غير منصبة

source: Selected Packages
ar: الحزم المختارة

source: Unable to get status for search results. The catalogs have not been loaded. Please try after few seconds.
ar: لايمكن من الحصول على حالة نتائج البحث الكاتالوجات لم تحمل الرجاء المحاولة بعد عدة ثواني

source: Fetching legal information...
ar: جلب معلومات شرعية ....

source: Add...
ar: أضف...

source: Refreshing catalogs
ar: إعادة تحديث الكاتالوج

source: Refreshing catalogs...
ar: إعادة تحديث الكاتالوج ....

source: Selected for Removal:
ar: مختار من أجل إزالة :

source: Selected for Install/Update:
ar: إختر للتنصيب\الترقية :

source: Select packages by marking checkbox
ar: إختر الحزم بوضع إشارة ضمن المربع

source: Package Name
ar: إسم الحزمة

source: Fetching description...
ar: جلب التفاصيل ....

source: Fetching information...
ar: جلب المعلومات ....

source: This might be caused by network problem while accessing the repository.
ar: هذه ممكن أن تكون بسبب مشكلة ضمن الشبكة عند الدخول الى المستودع

source: Description not available for this package...
ar: التفاصيل غير متوفرة لهذه الحزمة ....

source: Files Details not available for this package...
ar: تفاصيل الملف غير متوفرة لهذه الحزمة ....

source: Dependencies info not available for this package...
ar: معلومات التبعية غير متوفرة لهذه الحزمة ....

source: Information not available for this package...
ar: المعلومات غير متوفرة لهذه الحزمة ....

source: Dependencies:
ar: التبعيات:

source: Summary:
ar: ملخص :

source: Size:
ar: حجم:

source: Category:
ar: فئة:

source: Installed Version:
ar: الإصدار المنصب:

source: Packaging Date:
ar: تاريخ الحزمة :

source: None
ar: لا شئ

source: Not available
ar: غير متوفر

source: Network problem.
ar: مشكلة شبكة.

source: Details:
ar: تفاضيل :

source: catalogs successfully updated:
ar: نجاح ترقية الكاتالوجات :

source: Unknown error
ar: خطأ غير معروف

source: Selected repository does not contain any packages. Please reload the list of package.
ar: المستودع المختار لا يحوي على أي حزم الرجاء اعد تحميل قائمة الحزم

source: Processing package entries: %d of %d
ar: معالجة مدخلات الحزم : %d of %d

source: Loading Repository Information
ar: تحميل معلومات المستودع

source: Fetching package entries ...
ar: جلب مدخلات الحزم ....

source: Searching...
ar: بحث ....

source: %s: first %d found
ar: %s: الأول %d وجد

source: %s: %d found
ar: %s: %d وجد

source: %d listed
ar: %d مسجل

source: %d selected
ar: %d مختار

source: %d installed
ar: %d منصب

source: Save selected...
ar: حفظ المختار ....

source: Save selected packages...
ar: حفظ الحزم المختارة ....

source: command does not take operands
ar: الأمر لم يأخذ عملية حسابية

source: only -e or -n may be specified
ar: فقط -e or -n يمكن تعينهم

source: open requires one package name
ar: فتح المتطلبات إسم حزمة واحدة

source: No transaction ID specified using -t or in $PKG_TRANS_ID.
ar: ولا أجراء ID يعين -t or in $PKG_TRANS_ID.

source: No transaction ID specified in $PKG_TRANS_ID
ar: ولا أجراء ID يعين $PKG_TRANS_ID

source: No arguments specified for subcommand.
ar: ولا براهين تعين للأوامر الداخلية

source: A filename must be provided for this action.
ar: إسم الملف يجب يتوفر لهذا التنفيذ

source: pkgsend: illegal global option -- %s
ar: pkgsend: خيار عام غير شرعي -- %s

source: Unable to open manifest: %s
ar: لايمكن فتح بشكل واضح : %s

source: Unable to download files from: %s
ar: لايمكن تحميل الملف من : %s

source: Unable to create directory: %s
ar: لايمكن إنشاء المجلد : %s

source: Unable to extract file: %s
ar: لا يمكن فك ضغط الملف : %s

source: Unable to download manifest %s from %s
ar: لا يمكن تحميل بشكل ظاهر %s من %s

source: Unable to open file: %s
ar: لا يستطيع فتح الملف : %s

source: Error occurred while reading from: %s
ar: خطأ حدث أثناء القراءة من : %s

source: Error occurred while writing to: %s
ar: خطأ حدث أثناء الكتابة الى : %s

source: Unable to download catalog from: %s
ar: لايمكن تحميل الكاتالوج من : %s

source: Error while reading from: %s
ar: خطأ حدث خلال القراءة من : %s

source: Illegal option -- %s
ar: خيار غير شرعي : %s

source: must specify a server
ar: يجب تعين مخدم

source: -n takes no options
ar: -n لا تأخذ أي خيار

source: must specify at least one pkgfmri
ar: يجب عليك على الأقل إختيار واحد pkgfmri

source: %(fmri)s is an illegal fmri: %(error)s
ar: %(fmri)s غير شرعي fmri: %(error)s

source: No files to retrieve.
ar: لاتوجد ملفات للإستلام

source: A text message describing the updates is displayed near the panel's Notification Area when updates become available if set to true.
ar: الرسالة النصية تشرح الترقية التي تظهر بجانب لوحة منطقة التنبيه عندما الترقية تصبح متاحة وتعين لتكون بإشارة صحيحة

source: How often to check for updates
ar: كيف بالغالب تتحقق من الترقيات

source: How often to check for updates. The valid values are Daily, Weekly, Monthly, Never
ar: كيف بالغالب تتحقق من الترقيات . القيمة الصالحة يومي , شهري ,أبدأ

source: Start delay
ar: بداية تأخير
