Repository: AndWac/pkg5
Catalog: src/po/*.po
Languages: ar

source: The notify icon is displayed on startup if set to true.
ar: أيقونة التنبيه تظهر عند الإقلاع وتعين لتوكن بإشارة صحيحة

source: The time, in seconds, that the updatemanagernotifier should wait, after starting, before checking for updates.
ar: التوقيت , ثواني ,updatemanagernotifier يجب أن ينتظر , بعد الإقلاع , قبل التحقق من الترقية

source: The updatemanagernotifier program terminates after the user activates the icon in the notification area if set to true.
ar: برنامج updatemanagernotifier يوقف عن العمل بعد تفعيل المستخدم لأيقونة التنبيه التي تعين لتكون بإشاءة صحيحة

source: Whether to always display the icon on startup
ar: على كل حال لإظهار الأيقونة عند الإقلاع

source: Whether to display text message when updates are available
ar: على كل حال الرسالة النصية تظهر عند توفر الترقية

source: Whether to terminate updatemanagernotiifer after icon activation.
ar: على كل حال يتوقف عمل برنامج updatemanagernotiifer بعد أن تصبح الأيقونة فعالة

source: Install available updates
ar: نصّب التطويرات المتوفرة

source: Update Manager
ar: مدير التطوير

source: <b>Evaluate</b>
ar: <b>التقييم</b>

source: <b>Latest Version _Details</b>
ar: <b>أخر تفاصيل_ الإصدارات </b>

source: <b>_Details</b>
ar: <b>_تفاصيل </b>

source: Close dialog when _finished
ar: أغلق المربع عند _الإنتهاء

source: Index
ar: فهرسة

source: Install Update
ar: تنصيب الترقية

source: Updates are available for the following packages. Select the packages you want to update and click Install.
ar: الترقية متوفرة للحزم التالية أختر الحزم المراد للترقية ثم إضغط على تنصيب

source: _Cancel
ar: _إلغاء

source: _Install Updates
ar: _تنصيب الترقية

source: _OK
ar: _موافق

source: _Select all Updates
ar: _إختر ترقية الكل

source: Notify user when updates are available
ar: أبلغ المستخدم عند توفر التطويرات

source: Update Manager Notifier
ar: مبلّغ مدير التطويرات

source: Fetching catalog: '%s' ...
ar: جلب الكاتالوج: '%s' ....

source: Fetching catalog
ar: جلب الكاتالوج

source: Creating Plan ...
ar: إنشاء الخطة ....

source: Creating Plan
ar: إنشاء الخطة

source: Verifying: %s ...
ar: تحقق : %s ....

source: Verifying
ar: تحقق

source: Completed
ar: إكمال

source: GUI will not respond to any event! %s. Check updatemanager.py signals
ar: GUI لاتوجد إستجابة لأي من الأحداث !%s تحقق من updatemanager.py إشارة

source: Evaluate
ar: التقييم

source: Evaluate - canceling...
ar: التقييم - إلغاء ....

source: Download - canceling...
ar: التحميل - إلغاء ....

source: Evaluate - failed
ar: التقييم - فشل

source: Download - failed
ar: التحميل - فشل

source: Install - failed
ar: التنصيب - فشل

source: Index - failed
ar: الفهرسة - فشل

source: Updates are available for the following packages. Click Update All to create a new boot environment and install all packages into it.
ar: الترقية متوفرة للحزم التالية إضغط على ترقية الكل لإنشاء بيئة إقلاع جديدة وتنصيب كل الحزم بداخله .

source: Latest Version
ar: أخر إصدار

source: Size (Meg)
ar: الحجم (Meg)

source: count: %d
ar: عدد : %d

source: Error
ar: خطأ

source: '%s' is not an install image
ar: '%s'الصورة لم تنصب

source: Version mismatch: expected %s received %s
ar: الإصدار غير متاوفق : متوقع %s إستلام %s

source: <b>No Updates available.</b>
ar: <b>لاتوجد ترقية متوفرة .</b>

source: %s is not valid image, trying root image
ar: %s ليست صورة صحيحة للنظام ,حاول بصورة حاصة بالroot

source: %s is not valid root image, return None
ar: %s ليست صورة صحيحة للroot , المقابل لا شي

source: Fetching details for %s ...
ar: جلب تفاضيل من أجل %s ....

source: No details available
ar: لاتوجد تفاصيل متوفرة

source: Canceling update, please wait ...
ar: إلغاء الترقية , الرجاء الإنتظار ....

source: Unable to cancel at this time.
ar: لايمكن الإلغاء الأن

source: Installing Updates
ar: تنصيب الترقية

source: ERROR
ar: خطأ

source: Following Incorporated package(s) cannot be updated:
ar: الحزم المدرجة التالية (s) لايمكن ترقيتها :

source: Update using: Update All
ar: الترقية بإستخدام : ترقية الكل

source: ERROR
ar: خطأ

source: Update All finished successfully in %1.f mins
ar: ترقية الكل تمت بنجاح ب %1.f mins

source: Update All finished successfully in < 1 min
ar: ترقية الكل تمت بنجاح ب < 1 min

source: Update All Completed
ar: إنتهاء ترقية الكل

source: Nothing selected to update.
ar: لا إختيار للترقية

source: Updating ...
ar: الترقية ....

source: Evaluate
ar: التقييم

source: Update error in plan install:
ar: خطا الترقية بخطة التنصيب :

source: Update unexpected API error:
ar: ترقية خطأ الغير متوقع API

source: Update unexpected error:
ar: ترقية خطأ غير متوقع

source: Packages to be installed:
ar: الحزم للتنصيب

source: Update
ar: ترقية

source: Update finished successfully.
ar: إنتهاء عملية الترقية بنجاح

source: %s Download failed: %s
ar: %s فشل التحميل: %s

source: %s exceded available disc space
ar: %s تجاوز مساحة القرص المتوفرة

source: %s unexpected error:
ar: %s خطأ غير متوقع :

source: %s Execute plan failed: %s
ar: %s فشل خطة التنفيذ: %s

source: Not enough disc space, the Update All action cannot be performed. Click OK to manage your existing BEs and free up disk space or Cancel to cancel Update All.
ar: لاتوجد مساحة كافية على القرص إن عملية الترقية الكل لن تنفذ إضغط على موافق لإدارة BEs الموجودة ولتوفير مساحة على القرص أو إلغاء لإلغاء عملية الترقية للكل

source: Not Enough Disc Space
ar: لاتوجد مساحة كافية على القرص

source: Download
ar: تحميل

source: Install
ar: تنصيب

source: %s %d/%d actions
ar: %s %d/%d تنفيذ

source: Index
ar: فهرس

source: %-25s %d/%d actions
ar: %-25s %d/%d تنفيذ

source: Checking for new software
ar: التحقق من البرامج الجديدة

source: Updates are available
ar: الترقية متوفرة

source: Updates available Please click on icon to update.
ar: الترقية متوفرة الرجاء إضغط على أيقونة الترقية

source: Another instance of UpdateManagerNotify is running
ar: نسخة إضافية من برنامج UpdateManagerNotify تعمل
