Repository: AndWac/pkg5
Catalog: src/po/*.po
Languages: ar

source: -s and -v may not be combined
ar: -s and -v لا يمكن ضمهم

source: no packages installed
ar: لايوجد حزم منصبة

source: No specified packages have available updates
ar: الحزم المختارة لايوجد لها أي تحديثات

source: No installed packages have available updates
ar: الحزم المنصبة لايوجد لها أي تحديثات

source: no packages matching '%s' %s
ar: لايوجد حزم متوافقة '%s' %s

source: Created ZFS snapshot: %s
ar: إنشاء لقظة او صورة عن ZFS: %s

source: verify: -v and -q may not be combined
ar: تحقق : -v and -q لايمكن جمعهم

source: pkg: no packages matching the following patterns you specified are installed on the system.
ar: pkg: لاتوجد حزم متوافقة مع النموذج المختار المنصبة ضمن النظام

source: All other patterns matched installed packages. %s
ar: كل النماذج توافق الحزم المنصبة . %s

source: image-update: -v and -q may not be combined
ar: image-update: -v and -q لامكن جمعهم

source: image-update: command does not take operands ('%s')
ar: امر image-update: لا يأخد عملية حسابية ('%s')

source: No image rooted at '%s'
ar: لايوجد صورة ترسخ على '%s'

source: No updates available for this image.
ar: لايوجد ترقية متوقرة للصورة الأن

source: image-update failed (inventory exception): %s
ar: فشل image-update (inventory exception): %s

source: WARNING: pkg(5) appears to be out of date, and should be updated before running image-update.
ar: تحذير : pkg(5) يظهر انه خارج مدة الصلاحية , ويجب عليك الترقية قبل running image-update.

source: Please update pkg(5) using 'pfexec pkg install SUNWipkg' and then retry the image-update.
ar: رجاء ترقية pkg(5) بإستعمال 'pfexec pkg install SUNWipkg' ثم حاول the image-update.

source: An unexpected error happened while preparing for image-update:
ar: حدث خطأ غير متوقع في الوقت الذي تستعد من أجل ترقية الصورة

source: image-update failed: %s
ar: فشل image-update : %s

source: image-update cannot be done on live image
ar: image-update لايمكن أن ينجح على الصورة المباشرة

source: An unexpected error happened during image-update: %s
ar: حدث خطأ غير متوقع من خلال ترقية الصورة : %s

source: install: at least one package name required
ar: تثبيت : حزمة واحدة على الأقل من اسم المطلوب

source: install: -v and -q may not be combined
ar: التنصيب : -v and -q لايمكن جمعهم

source: '%s' is not an install image
ar: '%s' هي ليست صورة للتنصيب

source: install failed (inventory exception): %s
ar: فضل التنصيب (inventory exception): %s

source: An unexpected error happened while preparing for install:
ar: حدث خطأ غير متوقع من خلال التحضير لعملية التنصيب :

source: installation failed: %s
ar: فضل التنصيب : %s

source: An unexpected error happened during installation: %s
ar: حدث خطأ غير متوقع من خلال التنصيب: %s

source: uninstall: at least one package name required
ar: إلغاء التثبيت : إسم حزمة واحد مطلوب

source: uninstall: -v and -q may not be combined
ar: إلغاء التثبيت : -v and -q لايمكن جمعهم

source: uninstall failed (inventory exception): %s
ar: فشل إلغاء التثبيت (inventory exception): %s

source: uninstallation failed: %s
ar: فشل عملية إلغاء اinventory exceptionلتثبيت : %s

source: An unexpected error happened during uninstallation: %s
ar: حدث خطأ غير متوقع من خلال عملية إلغاء التثبيت : %s

source: %s is not a valid server URL.
ar: %s ليس عنوان مخدم صحيح

source: info: -l and -r may not be combined
ar: معلومات : -l and -r لايمكن جمعهم

source: info: must request remote info for specific packages
ar: معلومات : يجب عليك طلبب المساعدة البعيدة للحزم المعينة

source: Installed
ar: منصب

source: Not installed
ar: غير منصب

source: Name:
ar: إسم :

source: Summary:
ar: ملخص :

source: Category:
ar: فئة :

source: State:
ar: ولاية :

source: Publisher:
ar: الناشر :

source: Version:
ar: الإصدار :

source: Build Release:
ar: بناء الإصدار :

source: Branch:
ar: فرعي :

source: Packaging Date:
ar: تاريخ الحزمة :

source: Size:
ar: الحجم :

source: pkg: no packages matching the following patterns you specified are installed on the system. Try specifying -r to query remotely:
ar: pkg : لايوجد حزم متطابقة مع النموذج المعين المنصب على النظام . حاول التعديل -r لأمر بعيد :

source: pkg: no packages matching the following patterns you specified were found in the catalog. Try relaxing the patterns, refreshing, and/or examining the catalogs:
ar: pkg : لايوجد حزم متطابقة مع النموذج المعين الموجود ضمن الكاتالوج . حاول إعادة تعين النموذج, إعادة تحديث بحث ضمن الكاتولجات :

source: '%s' matches multiple packages
ar: '%s' تطابق عدد من الحزم

source: no license information could be found for the following packages:
ar: لايوجد معلوامت ضمن الإتفاقية لهذه الحزم

source: contents: -l and -r may not be combined
ar: المحتويات : -l and -r لايمكن جمعهم

source: contents: must request remote contents for specific packages
ar: المحتويات : يجب طلب محتويات من بعيد للحزم المطلوبة

source: contents: -m and %s may not be specified at the same time
ar: المحتويات : -m and %s لايمكن تعينهم بنفس الوقت

source: Invalid attribute '%s'
ar: السمات خاطئة '%s'

source: pkg: '%s' matches multiple packages
ar: pkg : '%s' تطابق عدة حزم

source: pkg: %s/%s catalogs successfully updated:
ar: pkg : %s%s النجاح بتحديث الكاتالوج :

source: Could not update catalog for '%s' due to insufficient permissions.
ar: لا يستطيع تحديث الكاتالوج ل '%s' لاتوجد صلاحيات كافية

source: Could not update a catalog due to insufficient permissions.
ar: لا يستطيع تحديث الكاتالوج لاتوجد صلاحيات كافية

source: Please try the command again using pfexec, or otherwise increase your permissions.
ar: رجاء اعد إستعمال الأمر pfexec, أو على خلاف ذلك بزيادة صلاحياتك

source: 'pkg publisher' will show a list of publishers.
ar: 'pkg publisher' سوف يظهر قائمة الناشر .

source: requires a publisher name
ar: مطلوب إسم الناشر

source: only one publisher name may be specified
ar: إسم ناشر واحد فقط يمكن ان يعني

source: the -p and -d options may not be combined
ar: خيارات -p and -d لايمكن جمعهم

source: publisher does not exist. Use -O to define origin URI for new publisher.
ar: الناشر غير موجود, إستعمل -O لتحديد العنوان الأساسي للناشر الجديد

source: The origin URIs for '%s' do not appear to point to a valid pkg server. Please check the server's address and client's network configuration. Additional details: %s
ar: العنوان (URL) الأساسي ل '%s' لايبدو أنه يشير الى مخدم الحزم الصحيح . رجاء تحقق من عنوان رقم IP للمخدم وإعدادات شبكة العميل معلومات إضافية : %s

source: Removal failed for '%(pub)s': %(msg)s
ar: فضل بالحذف ل '%(pub)s': %(msg)s

source: PUBLISHER
ar: الناشر

source: TYPE
ar: نوع

source: STATUS
ar: حالة

source: URI
ar: URL عنوان

source: (preferred)
ar: (مفضل)

source: (disabled)
ar: (غير مفعل)

source: origin
ar: الأصل

source: Cert. Effective Date:
ar: Cert. تاريخ التأثير:

source: Cert. Expiration Date:
ar: Cert. تاريخ الإنتهاء:

source: Origin URI:
ar: Origin عنوان(URI):

source: Mirror URI:
ar: Mirror عنوان(URL):

source: Publisher:
ar: الناشر:

source: Alias:
ar: إسم مستعار:

source: Client UUID:
ar: عميل UUID:

source: Catalog Updated:
ar: تحديث الكاتالوج:

source: Enabled:
ar: مفعل :

source: No
ar: لا

source: Yes
ar: نعم

source: set-property: requires a property name and value
ar: عين-الخاصية : يتطلب خاصية الإسم والقيمة

source: set-property: set-publisher must be used to change the preferred publisher
ar: عين-الخاصية : عين-الناشر يجب عليك الإستعمال لتغير الناشر المفضل

source: unset-property: requires at least one property name
ar: عدم تعين-الخاصية : على الأقل مطلوب خاصية واحدة بالإسم

source: unset-property: set-publisher must be used to change the preferred publisher
ar: عدم تعين-الخاصية : يجب عليك الإستعمال لتغير الناشر المفضل

source: unset-property: no such property: %s
ar: عدم تعين-الخاصية : لايوجد أي خاصية : %s

source: property: no such property: %s
ar: الخاصية : لايوجد خاصية : %s

source: image-create requires publisher argument to be of the form '<prefix>=<url>'.
ar: image-create يتطلب حجة من الناشر لكي تكون على شكل '<prefix>=<url>'.

source: image-create requires variant arguments to be of the form '<name>=<value>'.
ar: image-create يتطلب حجة مختلفة لكي تكون على شكل '<name>=<value>'.

source: image-create requires a single image directory path
ar: image-create يتطلب مسار مجلد صورة نظام مفردة

source: pkg: set-publisher: SSL key file '%s' does not exist
ar: pkg: تعين الناشر : SSL key ملف '%s' غير موجود

source: pkg: set-publisher: SSL key cert '%s' does not exist
ar: pkg: تعين الناشر : SSL key شهادة '%s' غير موجود

source: image-create requires a publisher argument
ar: image-create بتطلب حجة الناشر

source: image-create requires that a prefix not match: %s
ar: image-create يتطلب بادئة غير متطابقة : %s

source: image-create: publisher prefix has invalid characters
ar: image-create: خطأ بمحارف بادئة الناشر

source: image-create: publisher URI is invalid
ar: image-create:خطأ بعنوان (URL) الناشر

source: there is already an image at: %s
ar: هناك بالفعل صورة عن النظام : %s

source: To override, use the -f (force) option.
ar: للكتابة فوقه , إستعمل -f (force) خيار

source: Non-empty directory: %s
ar: مجلد غير-فارغ : %s

source: cannot create image at %s: %s
ar: لا يستطيع إنشاء الصورة على %s: %s

source: The URI '%s' does not appear to point to a valid pkg server. Please check the server's address and client's network configuration. Additional details: %s
ar: العنوان (URL) '%s' لايبدو أنه أي نقظة لمخدم الحزم الصحيح. الرجاء تفحص عنوان رقم المخدم وإعدادات الشبكة للعميل . معلومات إضافية : %s

source: rebuild-index: command does not take operands ('%s')
ar: امر rebuild-index: لايأخذ عملية حسابية ('%s')

source: history: -H and -l may not be combined
ar: history: -H and -l لايمكن جمعهم

source: TIME
ar: الوقت

source: OPERATION
ar: عملية

source: CLIENT
ar: عميل

source: OUTCOME
ar: نتيجة

source: illegal global option -- %s
ar: خيار عام غير مشروع --%s

source: %(opt)s takes argument of form name=value, not %(arg)s
ar: %(opt)s تأخد الحجة من الشكل الإسم=قيمة, ليست %(arg)s

source: -R not allowed for %s subcommand
ar: -R لايسمح له من أحل %s كأمر داخلي

source: illegal %s option -- %s
ar: غير شرعي %s خيار -- 5 %s

source: version: command does not take operands ('%s')
ar: الأصدار : الأمر لايأخذ عملية حسابية ('%s')

source: Could not find image. Use the -R option or set $PKG_IMAGE to point to an image, or change the working directory to one inside the image.
ar: لايمكن إيجاد الصورة, إستعمل خيار -R أو عين $PKG_IMAGEلنقظة لصورة , أو غير مجلد العمل لواحد داخل الصورة

source: No image found.
ar: لايوجد صورة

source: client configuration error: %s
ar: خطأ بإعدادات العميل : %s

source: History purged.
ar: حذف التاريخ

source: unknown subcommand '%s'
ar: أمر داخلي غير معرف '%s'

source: Maximum number of network retries exceeded during download. Details follow: %s
ar: الرقم الأكبر من محالات الشبكة تجاوزت خلال التحميل . التفاصيل تتبع : %s

source: An error was encountered while attempting to retrieve package or file data for the requested operation.
ar: خطأ قد حدث أثناء محاولة لاسترجاع ملف أو حزمة البياناتوطلبت لتشغيل

source: Unable to contact a valid package depot. This may be due to a problem with the server, network misconfiguration, or an incorrect pkg client configuration. Please check your network settings and attempt to contact the server using a web browser.
ar: غير قادر بالإتصال بمستودع الحزم . ممكن ان تكون هذه مشكلة من المخدم , خطأ بإعدادات الشبكة , أو خطأ بأمر pkg من قبل العميل

source: Additional details: %s
ar: معلومات إضافية : %s

source: An error was encountered while attempting to load history information about past client operations.
ar: خطأ قد حدث أثناء محاولةتحميل التاريخ المعلومات حول تشغيل العميل في الماضي

source: An error was encountered while attempting to store information about the current operation in client history.
ar: خطأ قد حدث أثناء محاولة لحفظ معلومات حول التشغيل الحالي ضمن تاريخ العميل

source: An error was encountered while attempting to purge client history.
ar: خطأ قد حدث أثناء محاولة لحذف تاريخ العميل

source: The pkg command appears out of sync with the libraries provided by SUNWipkg. The client version is %(client)s while the library API version is %(api)s
ar: أمر pkg يظهر أنه خارج التزامن مع المكتبة المتاحة من قبل SUNWipkg. إصدار العميل %(client)s عندما إصدار مكتبة API تكون %(api)s

source: This is an internal error. Please let the developers know about this problem by filing a bug at http://defect.opensolaris.org and including the above traceback and this message. The version of pkg(5) is '%s'.
ar: هذه تكون مشكلة داخلية . الرجاء دع المطورون أن يعلموا بهذه المشكلة من خلال فلترةالمشاكلhttp://defect.opensolaris.org and يحوي the وسبق هذه الرسالة traceback . هذا الإصدار من Pkg(5) '%s'

source: Accessories
ar: ملحقات

source: Administration and Configuration
ar: الإدارة والتهيئة

source: Application and Web Servers
ar: وتطبيق خوادم الإنترنت

source: Configuration and Preferences
ar: التكوين وتفضيلات

source: Core
ar: جوهر

source: Databases
ar: قواعد بيانات

source: Databases (System)
ar: قواعد بيانات (نظام)

source: Developer Tools
ar: أدوات التطوير

source: Display
ar: العرض

source: Distribution Tools
ar: أدوات التوزيع

source: Documentation
ar: وثائق

source: Enterprise Management
ar: إدارة متقدمة

source: File Managers
ar: مدير الملفات

source: File System
ar: نظام الملفات

source: Fonts
ar: الخطوط

source: Games
ar: ألعاب

source: Graphics and Imaging
ar: الرسوم والتصوير

source: Hardware
ar: الأجهزة

source: High Performance Computing
ar: عالية الأداء

source: Integrated Development Environments
ar: بيئة التنمية المتكاملة

source: Internationalization
ar: تدويل

source: Internet
ar: إنترنت

source: Libraries
ar: مكتبات

source: Libraries (System)
ar: مكتبات (نظام)

source: Localizations (Desktop)
ar: الموضع (سطح المكتب )

source: Localizations (System)
ar: الموضع (النظام )

source: Media
ar: وسائل الاعلام

source: Networking
ar: شبكات

source: Office
ar: مكتب

source: Other Languages
ar: لغات أخرى

source: Other Peripherals
ar: أجهزة طرفية أخرى

source: Packaging
ar: تحزيم

source: Plug-ins and Run-times
ar: مكونات إضافية وتوقيت التشغيل

source: Ports
ar: منافذ

source: Printing
ar: الطباعة

source: Security
ar: أمن

source: Services
ar: خدمات

source: Sessions
ar: جلسات

source: Software Management
ar: إدارة البرامج

source: Sound and Video
ar: الصوت والفيديو

source: Source Code Management
ar: إدارة الكود المصدري

source: Storage
ar: وحدة تخزين

source: System
ar: نظام

source: System Utilities
ar: ادوات النظام

source: Text Tools
ar: الأدوات النصية

source: Universal Access
ar: وصول للجميع

source: Window Managers
ar: مدير النوافذ

source: X11 (System)
ar: X11 (نظام)

source: Add More Software
ar: أضف المزيد من البرمجيات

source: Install, update and remove software packages
ar: نصّب، طوّر وأزل حزم البرمجيات

source: Package Manager
ar: مدير الحزم

source: <b>Add new repositories and manage existing ones.</b>
ar: <b> أضف مستودعات وإدارة واحدة موجودة مسبقا</b>

source: <b>Apply the following changes:</b>
ar: <b>التأكيد على التغيرات التالية :</b>

source: <b>Create New Boot Environment</b> Update All creates a new boot environment (BE) as a means of archiving the current BE. The new BE consists of the updated packages and is the default BE when the system is rebooted.
ar: <b>إنشاء بيئة إقلاع جديدة</b> ترقية الكل وإنشاء بيئة إقلاع جديدة (BE) تعرف كأرشيف الحالي BE. BE الجديد يحوي ترقية كاملة لكل الحزم والBE الإفتراضي عندما يعاد تشغيل النظام .

source: <b>Delete, rename and activate boot environments.</b>
ar: <b>حذف, إعادة تسمية تفعيل بيئة الإقلاع .</b>

source: <b>Modify Repository URL</b>
ar: <b>تعديل عناوين (URL) للمستودعات </b>

source: <b>PACKAGE NAME</b>
ar: <b>إسم الحزم</b>

source: <b>Package Name</b>
ar: <b>إسم الحزم</b>

source: <b>Review the packages to be removed:</b>
ar: <b>عرض الحزم التي سوف تحذف:</b>

source: <b>Search</b>
ar: <b>بحث</b>

source: <b>Startup</b>
ar: <b>إقلاع</b>

source: <b>_SSL Key and Certificate</b>
ar: <b>_SSL Key and شهادة</b>

source: <big><b>Package Manager Web Installer</b></big>
ar: <big><b>مدير الحزم تنصيب من الويب</b></big>

source: <i>_Repository:</i>
ar: <i>_مستودع:</i>

source: About
ar: حول

source: About Glade
ar: حول الفسحة

source: Browse for SSL Certificate
ar: تصفح من أجل شهادة SSL

source: Browse for SSL Key
ar: تصفح من أجل SSL key

source: Checking for latest SUNWipkg and SUNWipkg-gui, please wait...
ar: التحقق من أخر إصدار من SUNWipkg and SUNWipkg-gui, الرجاء الإنتظار...

source: Checking package dependencies...
ar: الحقق من تبعية الحزم

source: Clear
ar: مسح

source: Click to get list of newest packages.
ar: إضغط للحصول على قائمة بأجدد الحزم .

source: Click to update all installed packages.
ar: إضغط لترقية كل الحزم المنصبة

source: Copy
ar: نسخ

source: Currently active boot environment
ar: بيئة الإقلاع المفعلة الحالية

source: Cut action
ar: قطع العمل

source: Dependencies
ar: التبعية

source: Deselect selected packages
ar: إلغاء أختيار الحزم المختارة

source: Details
ar: تفاصيل

source: Download
ar: تحميل

source: Files
ar: ملفات

source: Install
ar: تنصيب

source: Install or Update selected packages
ar: تنصيب أو ترقية الحزم المختارة

source: Install/Update
ar: تنصيب\ترقية

source: Install/Upgrade Check
ar: تحقق من تنصيب\ترقية

source: Legend:
ar: إسطورة :

source: License
ar: إتفاقية

source: Manage Boot Environments
ar: إدارة بيئة الإقلاع

source: Manage Repositories
ar: إدارة المستودعات

source: Manage _Boot Environments...
ar: إدارة _ بيئة الإقلاع...

source: Modify Repository
ar: تعديل المستودع

source: Package Manager Preferences
ar: تفضيلات مدير الحزم

source: Paste
ar: لصق

source: Preferences
ar: تفضيلات

source: Preparation
ar: خصائص

source: Proceed only if you trust this new repository
ar: نفذ فقط إذا كنت على ثقة هذا المستودع الجديد

source: Processing
ar: معالجة

source: Quit application
ar: خروج التطبيق

source: Reload
ar: إعادة تحميل

source: Remove
ar: إزالة

source: Remove Confirmation
ar: إزالة التأكيد

source: Remove selected packages
ar: إزالة الحزم المختارة

source: SSL Key and Certificate
ar: SSL Key and شهادة

source: SSL _Certificate:
ar: SSL _شهادة:

source: Search
ar: بحث

source: Select All Items
ar: إختر كل العناصر

source: Select Updates
ar: إختر تحديث

source: Select _All
ar: إختر _الكل

source: Select _Updates
ar: إختر _تحديث

source: Select from the list to modify or remove existing repositories.
ar: إختر من القائمة لتعديل أو لإزالة المستودعات الموجودة سابقا

source: Select packages by marking the checkbox and click to Install/Update.
ar: إختر الحزم بإشارة ضمن المربع ثم إضغط على تنصيب\ترقية

source: Select packages by marking the checkbox and click to Remove selected.
ar: إختر الحزم بإشارة ضمن المربع ثم إضغط إزالة

source: Short description
ar: تفصيل قصير

source: Start Page
ar: صفجة البدأ

source: Start _Page
ar: صفجة _البدأ

source: The folllowing will be added to your system
ar: التالي سوف تضاف الى نظامك

source: This is a secure repository. Refer to the posted
ar: هذا المستودع الأمن , الرجوع الى الموقع

source: This repository requires a SSL Key and certificate. Enter the location of these files in the spaces provided, or use the Browse buttons to provide their location.
ar: هذا المستودع يتطلب SSL Key و شهادة . أدخل مسار الملف ضمن المساحة المتاحة , أو إستعمل المتصفح

source: Type text to search name and description of the package.
ar: أدخل النص للبحث على الإسم وتفصيل الحزمة

source: Update All
ar: ترقية الكل

source: Update all packages
ar: ترقية كل الحزم

source: Updates
ar: الترقية

source: _About
ar: _عن

source: _Add
ar: _إضافة

source: _Browse
ar: _تصفح

source: _Clear
ar: _مسح

source: _Copy
ar: _نسخ

source: _Edit
ar: _تحرير

source: _Enable type ahead search (slow on large repositories)
ar: _تفعيل النوع قبل البحث (بظئ على المستودعات الكبيرة)

source: _File
ar: _ملف

source: _Help
ar: _مساعدة

source: _Install / Update
ar: _تنصيب\ترقية

source: _Instructions
ar: _تعليمات

source: _Manage Repositories...
ar: _إدارة المستودعات

source: _Modify...
ar: _تعديل

source: _Name:
ar: _إسم:

source: _Package
ar: _الحزمة

source: _Paste
ar: _لصق

source: _Proceed
ar: _تنفيذ

source: _Quit
ar: _خروج

source: _Remove
ar: _إزالة

source: _Show Start Page on startup
ar: _أظهر نافذة البدأ عند الإقلاع

source: _URL:
ar: _عنوان (URL):

source: _Update All
ar: _ترقية الكل

source: lf the repository requires a SSL key and certificate, or if it has mirrors, add the new repository, and then click Modify to add additional information.
ar: إذا المستودع يطلب SSL Key وشهادة , او إذا كان Mirror أضف جديد مستودع , ثم إضغط على تعديل وأضف تفصيل أخرى

source: A boolean which determines if the Start Page should be shown on startup or the initial list view.
ar: أمر boolean يتحقق إذا ماكان ضفحة البدأ يجب أن تكون عند الإقلاع أو تحقق من قائمة العرض

source: A boolean which determines if the search is executed dynamically as user types or only when user hits the return key.
ar: أمر boolean يتحقق إذا البحث ينفذ بشكل أتوماتيكي عند كتابة المستخدم او فقط عندما يضغط المستخدم على زر إدخال

source: An integer which identifies the initial show filter value to be displayed when packagemanager starts. 0 corresponds to All Packages.
ar: العنصر المحدد الذي يتحقق ليظهر فلتر عندما مدير الحزم يبدأ. 0 يقابل كل الحزم

source: An integer which identifies the initial toplevel value to be displayed when packagemanager starts. 0 corresponds to All Categories.
ar: العنصر المحدد الذي يتحقق الستوى الأعلى من القيمة ليظهر عندمامدير الحزم يبدأ. 0 يقابل كل الحزم

source: Enable type ahead search
ar: تفعيل النوع قبل البحث

source: Initial section value
ar: التحقق قيمة القسم

source: Initial show filter value
ar: تحقق يظهر قيمة الفلتر

source: Show Start Page on startup
ar: أظهر صفحة البدأ عند بدأ التشغيل

source: GUI will not respond to any event! %s. Check webinstall.py signals
ar: GUI لايوجدإستجابة لأي حدث ! %s تحقق من webinstall.py إشارة

source: Add New Repository
ar: إضافة مستودع جديد

source: Add New Repositories
ar: إضافة مستودعات جديدة

source: All specified repositories and packages are already on the system.
ar: كل المستودعات المحددة والحزم موجود ضمن النظام مسبقا .

source: Install Packages
ar: تنصيب الحزم

source: Proceed only if you trust these new repositories
ar: تنفيذ فقط عندما توجد| الئقة من هذه المستودعات

source: Repository Error
ar: خطأ المستودع

source: API Error
ar: خطأ API

source: Error
ar: خطأ

source: Error reading the p5i file.
ar: خطأ بقراءة P5i ملف

source: The <b>libbe</b> library was not found on your system. All functions for managing Boot Environments are disabled
ar: The <b>libbe</b> المكتبة غير موجودة ضمن النظام m. كل الخيارات لإدارة بيئة الإقلاع غير مفعلة d

source: BE management
ar: BE إدارة

source: GUI will not respond to any event! %s. Check beadmin.py signals
ar: GUI لايوجدإستجابة لأي حدث ! %s تحقق من webinstall.py إشارة

source: Loading Boot Environment Information
ar: تحميل معلومات بيئة الإقلاع

source: Fetching BE entries...
ar: جلب مدخلات BE

source: Boot Environment
ar: بيئة الإقلاع

source: Created
ar: أنشأ

source: Size
ar: الحجم

source: Active on Reboot
ar: مفعل عند أعادة التشغيل

source: Delete
ar: حذف

source: Applying changes
ar: تطبيق التغيرات

source: Applying changes, please wait ...
ar: تطبيق التغيرات , الرجاء الإنتظار ....

source: Active on reboot:
ar: مفعل عند أعادة التشغيل :

source: to
ar: الى

source: <b>Couldn't change Active Boot Environment to:</b>
ar: <b>لا أستطيع تغير تفعيل بيئة الإقلاع الى :</b>

source: <b>Couldn't delete Boot Environments:</b>
ar: <b>لا أستطيع حذف بيئةالإقلاع :</b>

source: <b>Couldn't rename Boot Environments:</b>
ar: <b>لا أستطيع تغير إسم بيئة الإقلاع :</b>

source: BE error
ar: خطأ BE

source: The <b>libbe</b> library couldn't prepare list of Boot Environments. All functions for managing Boot Environments are disabled
ar: The <b>libbe</b> المكتبة لا تستطيع تحضير قائمة بيئات الإقلاع. كل الخيارات لتعديل بيئات الإقلاع غير مفعلة

source: Preparing...
ar: التحضير ....

source: Downloading...
ar: تحميل ....

source: Installing...
ar: تنصيب ....

source: GUI will not respond to any event! %s. Check installupdate.py signals
ar: GUI لايوجدإستجابة لأي حدث ! %s تحقق من webinstall.py إشارة

source: Removing...
ar: إزالة ....

source: Canceling...
ar: إلغاء ....

source: BE name is in use
ar: BE الإسم مستخدم
